e r
i n
o n
r e
s t
o r
a t
e n
t h
l i
s e
l e
t i
a n
g e
a l
t e
a r
c e
d e
r o
c o
s s
m e
in g
m p
r i
li c
ge t
u r
i s
th e
en t
a c
ti on
p u
at e
c on
n e
f i
i d
st r
e x
l a
at i
u l
i mp
pu b
t y
pub lic
or t
c h
e c
l o
t o
a p
a d
u n
e d
str ing
in t
re t
u e
a me
p ro
i t
ur n
ret urn
i f
o f
n o
imp ort
se t
ne w
b u
ati on
s er
s i
f or
n ame
a ge
th is
p e
p tion
d i
v er
m ent
m o
p er
a b
o u
p ar
e l
or g
an d
a s
t r
a v
t er
re s
ul l
ex ce
f in
a m
c la
ty pe
x t
n ull
v al
exce ption
i l
\ \
li st
v i
q u
ec t
d er
cla ss
0 0
lic en
o b
licen se
v o
b o
val ue
j ect
p o
d o
u p
en d
h t
te xt
c t
av a
p ri
fi le
fin al
vo id
ab le
i o
co m
con t
k e
b e
a ss
ro w
m a
e s
j ava
ou t
f o
ac k
te st
i th
h e
a re
v ate
s u
ri bu
ad d
ul t
co mp
d at
pri vate
s p
s h
a g
ob ject
b y
te d
\ '
th row
f a
no t
ati c
o ur
u m
a se
p re
st atic
en er
le ment
r a
c tion
ac t
u ti
w ith
co de
co l
ap p
pu t
uti l
dat a
f er
no de
l in
er t
c re
lo c
al l
v e
our ce
an ce
lo g
s c
par am
or y
ass ert
ke y
e m
e v
u ser
m ap
ss i
mo de
bo o
a li
al s
o l
int er
w or
for m
ac he
u se
e lement
si on
p at
con text
g ht
n t
ssi on
pro per
le an
e qu
do c
o p
cre ate
res ult
boo lean
o ver
in st
vi ce
me ss
la y
tr ue
throw s
s y
p y
ti me
u le
mess age
un d
ev ent
q ue
mode l
re ad
p ack
d ate
z e
el d
equ als
co py
b le
ser vice
i te
fi eld
en ce
m l
g ro
g ener
at or
li p
pack age
i c
g n
a u
at t
a in
at ch
ac tion
u s
o d
w ri
di st
lip se
an t
inst ance
t p
pat h
l en
c ur
ra y
ribu te
i m
ap ache
g er
st ate
p ort
ver sion
ec lipse
u re
ar ray
f al
m an
fal se
g in
en ti
gro up
e w
fi g
in de
ce ss
p t
on g
si ze
g r
un der
h as
f act
t w
ht tp
me th
l u
m s
ar t
w w
vi ew
inde x
m i
con fig
se e
w h
ri ght
meth od
el se
que st
c ted
an y
cont ent
l y
proper ty
com m
c ase
over ri
re e
er r
att ribute
lin k
overri de
r an
ex t
sc ri
y ou
l l
bu il
wor k
g u
re quest
by te
fa ult
dist ribu
s of
ti es
r ule
res ource
t a
s ource
w ar
w e
g i
p r
co un
b er
lo w
tw are
l an
sof tware
de fault
h and
su b
ite m
ed it
g th
x ml
ch an
th at
len gth
in fo
st art
bu f
f ro
t able
f e
st re
err or
in d
fro m
se le
l ong
on e
in put
co re
tr an
stre am
ate d
fact ory
o c
st em
qu er
sp ec
r un
sy stem
cur re
r y
au th
n um
u i
th er
ar y
quer y
a y
ag er
cont ain
list ener
fer ence
a ce
coun t
0 1
man ager
pro te
m in
n g
loc k
s w
tr y
d is
n s
sh o
n al
lin e
ec k
ex pre
bu t
fi c
ch eck
prote cted
o m
curre nt
h o
in te
f r
de scri
distribu ted
w n
re mo
copy right
par ame
parame ter
lo ad
imp l
st at
b ase
c li
ation s
app end
ex p
con ne
p lay
u ri
op en
k en
on ent
fa ce
mo d
inter nal
res p
c atch
l er
t ing
ch ar
cli ent
i p
v ali
ent ry
comp onent
end s
tran s
le t
buil der
in c
with out
u ct
to ken
or der
di tion
enti ty
ma y
buf fer
ur l
chan ge
c an
resp on
spec i
po s
ser ver
im age
v is
o g
i g
p are
edit or
1 0
ar d
o per
o ption
war ran
col um
c al
d ou
s o
la b
re ct
dou ble
ext ends
il d
su per
de d
c or
c all
ne xt
fo und
v ar
pro ject
m ar
col le
fi l
auth or
re gi
pr int
fo l
as k
2 00
re f
v id
sp ace
wri te
il l
av e
0 x
po int
ar ch
i st
hand ler
te mp
p age
fil ter
respon se
v ed
ch ild
ar g
it er
stat us
ne t
t ar
has h
form at
w id
ww w
. 0
app lic
d s
ul d
tar get
re ference
c lo
u ment
u st
ac ti
le ss
t ag
num ber
lab el
o ther
se ssion
m y
gn u
out put
inte ger
i re
wh i
o t
b ack
be an
up date
doc ument
lay out
f f
java x
a k
s on
ma x
st o
ur ation
imp lement
i li
n on
le d
n ing
str uct
m er
p an
pro cess
colum n
at ure
s up
or i
re p
un it
pare nt
li ed
colle ction
vid er
con dition
comm and
t ask
b lock
ex ec
mi ssion
m atch
pro vider
no ti
fr ame
col or
sto re
proper ties
con st
gener al
ac cess
le g
e t
re ss
g o
ap i
conne ction
an not
a mp
log ger
st er
expre ssion
s q
re qu
a x
u te
par ser
ab str
re n
d b
abstr act
m at
m it
b r
ti c
per mission
w ill
u t
m en
e p
gener ated
t on
imp lied
s ch
fi x
ili ty
he ad
la st
gr am
a st
const ant
cont ro
sho uld
config uration
par t
l s
ro ot
f lo
ali z
ac h
l ate
ap h
st ack
r c
but ton
fi r
f ree
o s
remo ve
de fin
ma in
requ ire
1 2
value s
t ree
sq l
i tion
ser i
ith er
vali d
gr aph
si tion
se arch
b re
to ol
g en
e mp
util s
i z
pt or
bu g
p lu
di rect
e ither
1 1
license s
par se
c ache
of f
fi er
bre ak
wor d
f un
c k
fir st
le te
gu age
lan guage
2 01
ke t
f t
ar gu
k er
th read
argu ment
lan g
00 00
inter face
loc al
i r
v el
we b
fe ature
require d
be gin
plu gin
la ble
b ind
l at
b it
n c
loc ation
imp le
condition s
c l
k ind
return s
mo re
ne l
comm on
me m
a le
contain er
o k
fi ed
fol low
p a
ce ll
iter ator
a f
read er
clo se
p h
use d
flo at
play er
pro to
d ing
speci fic
ad ap
li mit
head er
wri ter
run time
t ri
mod ule
oper ation
fin d
h el
pan el
ht ml
st y
de bug
in i
ini ti
descri ption
d y
le vel
if y
ser v
al og
fun ction
type s
de p
m on
ta il
var i
instance of
c ate
constant s
po sition
descri ptor
emp ty
c s
u al
vis i
si te
s rc
ro id
sty le
temp late
la ce
s imple
ab ility
en able
se c
- 1
sele ct
b und
wid th
j o
annot ation
p i
sele ction
di r
warran ty
e ma
i ght
l n
on t
found ation
me ta
and roid
off set
de tail
ter n
cont ribu
si gn
amp le
ec ted
add ress
ext en
re l
h ave
ter ms
h er
j son
ob j
bund le
leg al
t le
m ul
bo x
res ol
buil d
t or
adap ter
re cor
pos it
ri d
r on
applic ation
inc lu
permission s
0 2
si st
ms g
to p
l r
warran ties
men u
arg s
re ce
print ln
pro d
1 3
ra w
re posit
di alog
b in
set ting
ava i
t ain
rece i
po se
i e
w r
whi ch
i ty
con ver
pro gram
ol d
fo re
serv let
ob tain
defin ition
ti tle
name s
w t
c le
frame work
it or
ren der
vari able
expre ss
contain s
j ob
mo ck
name space
hand le
mo di
avai lable
reposit ory
ant lr
de lete
contribu tor
form ation
i gn
on ly
ran ge
l d
o wn
ex ist
n er
re port
s ing
do wn
fic ation
res ent
par tic
state ment
w in
g over
s in
en um
li br
p ass
se qu
ne d
m app
per sist
pro p
re g
f s
implement s
bo und
wh en
port al
con struct
v en
b as
go og
byte s
attribute s
ul ar
n ls
1 6
acti vi
d a
pre fix
goog le
exce pt
whi le
li ance
applic able
w s
fa il
license d
ho st
wri ting
regi str
u tion
c a
mul ti
e u
libr ary
or ted
n i
bind ing
dis play
distribu tion
enable d
fi t
re d
en c
it ch
bas is
comp liance
exp ected
detail s
li fer
lifer ay
me t
sele cted
2 .0
limit ations
he ight
li sh
un less
gover ning
wid get
b ar
u id
i es
less er
seri aliz
exten sion
parameter s
recor d
re ed
comp o
dat ab
trans action
own er
s b
f la
contro l
activi ty
r ing
la w
ati ve
in formation
s co
set s
hel per
w i
g rid
ag reed
sw itch
ment s
h i
win do
c ap
un i
pat tern
direct ory
in vo
mem ber
sh ort
mapp ing
ge o
b a
p ur
s oc
uri ty
f ul
pub lish
2 5
ro le
s v
j unit
ass ign
1 5
option s
9 9
sec urity
field s
in it
ne ss
j j
con str
x y
param s
sch ema
id enti
tr ack
au to
2 0
le ft
comp ar
s end
in s
il legal
sy n
sw t
s k
l t
se s
in di
r t
s ol
mod ify
1 4
cate g
sho w
datab ase
g l
chan nel
se d
sup p
load er
pre ference
ll er
sequ ence
implement ation
ser ved
f low
i con
sw ing
j et
a int
m ust
ic s
gi ven
c ust
right s
f ont
af ter
setting s
pur pose
scri pt
registr y
do main
partic ular
be fore
ac ce
fol der
li ter
re served
rep lace
windo w
pro vi
fla g
file s
de f
ev en
regi ster
message s
construct or
c lu
que ue
f ull
sco pe
at a
de cl
i led
ch ant
sp ring
ac ter
1 8
acti ve
tr ace
0 .
sh ip
char acter
y our
de st
00 0
i on
sup port
element s
mar k
it s
fit ness
c m
ect or
se con
w ay
ex ample
constr aint
m ary
al low
t s
b ra
ori gin
po st
exec ute
en gin
mer chant
x text
er e
s ave
cle ar
cur s
merchant ability
met ad
engin e
cust om
st op
t ab
metad ata
ma ke
change d
proto col
resource s
remo te
ti ve
lic k
contro ller
categ ory
w a
p si
comp le
or d
noti ce
b l
use ful
ch ron
un k
3 2
persist ence
ig no
wr ap
me di
li t
3 0
lo b
pro xy
pass word
r s
bo dy
ent er
mat h
p l
po lic
ex pr
h ol
wor ld
liter al
fa iled
do m
re st
result s
0000 0000
contributor s
s m
bo ss
d raw
in valid
identi fier
noti fication
all y
ass ist
lat er
dist ribute
2 4
mon itor
ac count
view er
trans form
child ren
recei ved
publish ed
st or
0 9
c ation
d t
er i
da o
t t
iz ed
tr a
de c
c lick
process or
re co
n or
v ector
g le
cal end
node s
sy m
calend ar
em f
ct or
assign ment
mat eri
in ser
compo site
con f
su ite
su c
ma il
ite ms
1 7
bin ary
ax is
call back
d ay
speci fied
bra ins
port let
pro g
ch o
supp orted
d f
polic y
de sc
c i
ic k
ad min
o w
lo ok
si c
war ning
en co
n am
me d
wh ere
initi al
ar ti
struct ure
at tr
service s
c at
e val
key s
decl ar
ho pe
st ep
6 4
fo o
re distribute
con su
st u
comp any
a ad
e f
r and
prog ress
s ses
w as
t al
method s
syn chron
g ing
test s
2 3
compar ator
boo k
b order
a wt
int ent
igno re
ad dition
create d
oc l
lo y
ass oc
d ro
as f
d l
inte l
final ly
lay er
object s
g ame
ct x
ou s
ker nel
v m
at om
vali date
ro ll
content assist
aad l
sin ce
201 1
se ction
1 9
jet brains
z er
no w
regi on
hol der
loc ale
suc cess
event s
po ol
u res
prod uct
wa it
tr act
k it
rel ation
s ort
provi ded
p le
curs or
m il
d if
ac ket
s n
p c
dep end
visi on
p resent
follow ing
vi rt
j av
man age
c ard
s en
no te
0 3
sym bo
ali ze
intel li
stor age
co ord
c er
gener ator
origin al
ther e
to do
j boss
soc ket
qu ali
ba sic
th en
su ch
to tal
do es
de leg
m t
com ment
c ast
id s
visi ble
as y
e st
b ig
0 4
ce s
pa ir
pro file
m u
al ong
s ame
inser t
mo ve
cla sses
ed ge
ate s
b i
sc an
assoc i
arti fact
ter min
pan e
su m
sp lit
intelli j
j s
addition al
prod u
per son
sh are
is h
rand om
rep resent
order ed
gram mar
w he
ap e
pri mary
3 4
net work
at ing
an gle
2 2
1 .
secon d
lat form
sing le
u uid
mo use
p lace
f y
g wt
de vice
tool s
time out
gro und
throw able
exist s
vis it
comp il
d r
key word
li b
fr ag
l v
us ing
mp s
ver y
sch ed
w are
0 .0
e ar
c ri
spring framework
enc y
201 0
p s
action s
collection s
qu o
res h
x s
declar ation
ri es
2 .
comp are
s ample
al y
b ro
are a
inclu de
in her
st and
mil li
p acket
i um
i ce
fi ll
p ed
d ri
annot ations
se par
synchron ized
ne ed
ig h
l f
cont act
t mp
in to
comp lete
auth enti
e le
c ance
whe ther
initi aliz
eval u
comm it
an aly
z z
g lob
s cre
clu ster
gener ic
log ging
201 2
p ay
no wn
t ch
resol ver
s a
match er
re c
se len
coun ter
virt ual
exec ution
scre en
6 3
selen ium
se g
el l
lo t
1 00
c p
content s
bound s
conver t
st amp
po pu
sub ject
jo in
ad o
2 7
ho me
mer ge
di ag
v es
conver ter
wrap per
cont in
ach ed
fin der
g h
medi a
si de
enco ding
re al
array s
e ss
wi se
inclu ding
pu sh
re q
valid ation
c r
ter m
bo t
k i
e ff
dep loy
su re
j ax
b ility
g y
link ed
pre ss
gu i
be en
r ad
di men
e ach
ic al
dimen sion
6 7
str ate
e core
fe tch
ent ries
al t
render er
p m
so me
acce pt
mem ory
im um
cal led
ut or
prop s
name d
0000 00
mar ker
colum ns
c ar
clo u
dy nam
ad oc
im al
inher it
argument s
g re
in ation
te x
share d
sv g
jav adoc
re vision
cal c
de l
read y
6 5
pat ch
t xt
a z
m ac
c c
ag ree
symbo l
point s
sub string
materi als
en vi
get s
d en
h ist
de sign
en code
2 8
reco gn
vali dat
0 7
re set
in ject
b en
reg ard
envi ron
c ss
consu mer
glob al
her e
par ti
ema il
other wise
graph ics
variable s
po ssi
ma de
sh ape
exec utor
frag ment
t d
vis itor
resol ve
dynam ic
3 3
j ar
j ust
log in
m b
os ate
po inter
sh all
ab o
inter r
common s
h ado
li ght
i a
hado op
1 .0
gener ate
modi fied
oper ations
n av
oper ator
equ al
example s
environ ment
user name
at ures
pro ble
ff ff
si g
deleg ate
ri x
sv n
ver ify
ad ded
check ed
er s
al f
h av
tw o
act ual
warning s
bo ard
fact or
ch ain
c d
pi x
sc ale
mi ted
p k
p latform
defin ed
att ach
separ ator
sc roll
strate gy
an ti
c f
constraint s
conne ct
z one
uni que
ag ent
so ap
i de
noti fy
d am
5 9
look up
low er
li mited
c enter
uti li
validat or
as set
ge st
c ated
6 6
abo ve
sup press
j db
fo c
b ed
preference s
cance l
p or
group s
b row
listener s
vi ous
stand ard
ep l
work space
th an
c ert
contin ue
re le
owner ship
dec imal
ti le
al g
regard ing
coord in
for med
pre vious
ca use
0 5
create s
me tri
buffer ed
mat rix
un ch
stu b
back ground
milli s
ali gn
to m
h ref
m al
jdb c
sp an
ur ned
end point
time stamp
ro u
ed u
e o
b on
4 5
dri ver
id entity
in ner
4 8
con n
n ative
serializ able
n able
r am
sign ature
n a
th ing
pix el
g t
map per
can not
bean s
sol ution
dam age
de s
dest ination
allow ed
2 9
la unch
ber n
enti al
face s
fe atures
len ame
tag s
d d
ret urned
fe ed
inter val
ex ter
invo ke
pre pare
select or
seri al
mu table
be st
base d
arch i
unk nown
ran k
hi bern
3 5
y y
un t
hibern ate
tran sp
instance s
h igh
sub st
dro p
stat s
6 0
s av
per form
run nable
sy nc
sub scri
n one
exter nal
fi lename
agree ments
flag s
st ri
end ing
comple x
cm d
be hav
a a
recogn ition
re ction
b ir
asy nc
co uld
error s
component s
p ing
en v
sen der
3 7
ret ri
compil er
comp an
sh ell
te ch
ch unk
us a
wi ki
ass er
pa int
m f
foc us
modi fier
200 9
p lan
j face
8 9
hist ory
ch art
exp ect
5 1
id x
nav ig
sk ip
ver ti
y ear
c ached
y pe
qu ick
row s
authenti cation
en e
d u
app ly
ori z
de li
pre di
ori es
s pe
user s
in e
2 6
in str
w iz
tri m
c y
us age
i or
mon th
e e
mo unt
th ri
re distribution
al ready
ac compan
dis cla
ne g
fer red
ali as
work flow
serializ er
thri ft
up le
av en
g reg
x x
enum er
0 8
seg ment
speci al
del ta
g pl
ke ep
dis able
tri g
cri ter
x p
tion s
eff ect
st ar
